{
  "game": {
    "title": "Terminus: Echoes of the Void",
    "description": "Navigate a derelict Space Hulk as a Deathwatch Kill Team, confronting xenos horrors and making impossible choices that will determine the fate of the galaxy.",
    "starting_scene": "scene_hulk_breach",
    "scenes": {
      "scene_hulk_breach": {
        "id": "scene_hulk_breach",
        "name": "Breaching the Leviathan's Wake",
        "description": "The Kill Team's Thunderhawk gunship, 'Vigil's Blade,' ripped through the colossal, fused hull of the Space Hulk, 'Leviathan's Wake.' The violent breach deafened, compressed air rushing out into the void, followed by a torrent of space debris. Now, the interior is an oppressive, silent nightmare – a labyrinth of decaying corridors woven from the skeletal remains of countless vessels. Zero-gravity chambers shimmer with motes of ancient dust, stirred by the intrusion, clinging to fractured bulkheads and organic growths that defy Imperial understanding. The air is thick with the metallic stench of stagnant machinery, decay, and something else, something subtly alien and unsettling.",
        "exits": {
          "beacon source": "scene_beacon_source"
        },
        "items": [],
        "npcs": [],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_beacon_source": {
        "id": "scene_beacon_source",
        "name": "Locating the Anomaly",
        "description": "The Kill Team navigates the treacherous, debris-strewn corridors of the Leviathan's Wake. Each step, each careful boost through zero-G, kicks up more dust, revealing the skeletal remains of forgotten ships melded into grotesque, organic structures. The fading distress signal, a garbled blend of Imperial vox-hailems and an unsettling, high-frequency xenos hum, pulls them deeper. Minor environmental hazards – collapsing sections, sudden depressurization pockets, sparking conduits – impede their progress. Faint, unsettling echoes seem to whisper promises and threats from the darkness. The signal intensifies, leading them to a section where Imperial cruiser bulkheads have been fused with glistening, chitinous walls, forming a grotesque, unholy marriage.",
        "exits": {
          "breach site": "scene_hulk_breach",
          "direct assault approach": "scene_first_genestealers",
          "cautious recon approach": "scene_ancient_lore_clue"
        },
        "items": [],
        "npcs": [],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_first_genestealers": {
        "id": "scene_first_genestealers",
        "name": "First Contact: The Awakening Cult",
        "description": "As the Kill Team breaches the chamber emitting the distress signal, the air shatters with screeching and chittering. They are ambushed by a small, but ferociously aggressive, contingent of Genestealer Hybrids. These twisted abominations, armed with scavenged weaponry and razor claws, surge from hidden vents and recesses. The beacon itself is revealed for what it truly is: not a distress signal, but a primitive, corrupted xenos device pulsing with a hypnotic lure, crudely integrated into an Imperial vox-caster. It's broadcasting a single, looping phrase in a distorted Imperial tongue: 'Come… join… awaken…' The coordinated attack and the sheer number of hidden access points hint at a larger, well-organized force, far beyond a simple infestation.",
        "exits": {
          "beacon source room": "scene_beacon_source",
          "ancient clue re-evaluation": "scene_ancient_lore_clue",
          "focus fire strategy": "scene_derelict_expedition",
          "containment strategy": "scene_derelict_expedition"
        },
        "items": [],
        "npcs": [
          {
            "id": "npc_cult_disciple_zealot_1",
            "name": "Cult Disciple Zealot",
            "description": "A gaunt, wild-eyed figure, crudely armored and wielding improvised bladed weapons. Its eyes burn with an unnatural fervor, and it mutters low, guttural blessings to its alien god.",
            "dialogue": {
              "greeting": "For the Star-God! You shall awaken with us!"
            }
          }
        ],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_derelict_expedition": {
        "id": "scene_derelict_expedition",
        "name": "Echoes of the Lost",
        "description": "Having neutralized the immediate Genestealer threat, the path ahead opens into a vast, silent chamber. Here, a tragic tableau unfolds: the mangled, derelict hull of an Imperial voidship, the 'Spirit of Sol,' has been grotesquely fused into the Space Hulk. Inside, the grisly remains of a previous Imperial expedition – skeletal figures in Power Armour, some clutching rusted bolters, others impaled by xenos growths – bear testament to a forgotten massacre. Fragmented data logs, barely clinging to life on damaged cogitators, tell a chilling tale of an expedition overwhelmed not just by xenos, but by an 'unseen horror' and 'the whispers from within.' Worse yet, unmistakable signs of ritualistic defilement mar the brave Imperial dead: crude xenos glyphs carved into armour, and skeletal hands arranged in unsettling patterns around a central, defaced Aquila.",
        "exits": {
          "first genestealers": "scene_first_genestealers",
          "technical data analysis": "scene_xenos_cathedral",
          "narrative log analysis": "scene_xenos_cathedral"
        },
        "items": [
          {
            "id": "artifact_commissar_log",
            "name": "Commissar's Doomed Log-Vox",
            "description": "A partially scorched and damaged Imperial log-vox module. It contains the last, frantic recordings of a Commissar.",
            "takeable": true
          }
        ],
        "npcs": [
          {
            "id": "npc_dead_servicitor",
            "name": "Malfunctioning Servitor (Scout)",
            "description": "A partially intact, heavily damaged Imperial servitor found slumped against a console, flickering with failing diagnostic lights.",
            "dialogue": {
              "greeting": "Distress... signal... corrupted..."
            }
          }
        ],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_xenos_cathedral": {
        "id": "scene_xenos_cathedral",
        "name": "The Xenos Cathedral",
        "description": "Deep within the Hulk, a vast, impossible chamber unfolds before you. It is a colossal space, not wrought by Imperial hands, but grown. Organic structures soar upwards, resembling petrified bone and pulsing chitin, converging into vaulted arches that mock Gothic design. Faint, unnatural light, a sickly purple and emerald, pulses from veins embedded within the walls, illuminating strange xenos glyphs that writhe with subtle, disturbing energy. The air thrums with psychic static, a dizzying chorus of alien intent. Below, a congregation of Genestealer cultists, a grotesque mockery of humanoids, performs a ritual. Their chanting, a guttural drone, reverberates around a central, dormant mass – an immense, shimmering ovoid object, veined with the same bio-luminescent light as the walls, radiating an ancient, chilling power. It is unmistakably the heart of this infection.",
        "exits": {
          "ancient lore site": "scene_ancient_lore_clue",
          "derelict expedition": "scene_derelict_expedition",
          "stealth approach": "scene_confront_patron",
          "direct assault approach": "scene_confront_patron"
        },
        "items": [
          {
            "id": "artifact_xenos_psy_amplifier",
            "name": "Xenos Psychic Amplifier Shard",
            "description": "A crystalline shard found near the Genestealer cult's ritual grounds, pulsating faintly with captured psychic energy.",
            "takeable": true
          }
        ],
        "npcs": [
          {
            "id": "npc_cult_disciple_zealot_2",
            "name": "Cult Disciple Zealot",
            "description": "A gaunt, wild-eyed figure, crudely armored and wielding improvised bladed weapons. Its eyes burn with an unnatural fervor, and it mutters low, guttural blessings to its alien god.",
            "dialogue": {
              "greeting": "Praise the Star-God! Awaken!"
            }
          }
        ],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_confront_patron": {
        "id": "scene_confront_patron",
        "name": "Confronting the Patriarch",
        "description": "The Kill Team surges towards the central mass, disrupting the ritual. But from the pulsating shadows beneath the nascent 'Heart of the Leviathan' emerges the Patriarch of the Genestealer Cult. It is a creature of nightmare: an ancient Purestrain Genestealer, colossal and grotesque, its chitin scarred by untold battles. Its four powerful arms ripple with psychic energy, its maw dripping with venom. Its eyes, ancient and cunning, burn with malevolent intelligence. As it attacks, the dormant 'Heart' behind it visibly stirs, emitting powerful psionic pulses that reverberate through your very thoughts, promising oblivion and whispering of ancient hunger. The Patriarch's psychic voice echoes in your mind: 'Foolish mites. You only accelerate our lord's awakening. He will devour you, as he will devour all.'",
        "exits": {
          "xenos cathedral": "scene_xenos_cathedral",
          "coordinated fire tactic": "scene_awakened_heart_dilemma",
          "close combat tactic": "scene_awakened_heart_dilemma"
        },
        "items": [],
        "npcs": [],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_awakened_heart_dilemma": {
        "id": "scene_awakened_heart_dilemma",
        "name": "The Heart Awakens: A Moral Crucible",
        "description": "The Patriarch's grotesque form lies broken, yet its defeat is a pyrrhic victory. With its psychic suppressor removed, the 'Heart of the Leviathan' pulses with an agonizing intensity. The vast chamber groans, its organic architecture twisting and reconfiguring around the awakening entity. Psionic energy washes over the Kill Team, not as an attack, but as an overwhelming, corrupted psychic impression: a fleeting vision of cosmos-spanning horror, of worlds consumed, of stars extinguished. The entity's true nature is laid bare – an ancient, nameless cosmic horror, capable of consuming entire worlds if fully unleashed upon the galaxy. The Space Hulk itself begins to tear itself apart around it, a cage struggling to contain an emerging god. The choice is stark and soul-shattering: destroy it all, attempt containment, or escape and leave an impossible legacy for the Imperium.",
        "exits": {
          "patron's chamber": "scene_confront_patron",
          "detonate hulk protocol": "scene_detonate_hulk_path",
          "contain entity protocol": "scene_contain_entity_path",
          "sacrifice escape plan": "scene_sacrifice_escape_path"
        },
        "items": [],
        "npcs": [],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_detonate_hulk_path": {
        "id": "scene_detonate_hulk_path",
        "name": "Self-Sacrifice: The Ragnarok Protocol",
        "description": "With a grim, united resolve, the Kill Team initiates the Ragnarok Protocol. Their desperate plan: to trigger a catastrophic chain reaction within the Space Hulk's unstable core, ensuring the 'Heart of the Leviathan's' destruction and their own demise. This involves planting high-yield melta-charges in critical, volatile junctions of the Hulk's fused core. Each placement is a race against time, navigating collapsing corridors, venting plasma conduits, and the Hulk's increasingly violent convulsions. Every step leads them closer to oblivion, a final, fervent act of Imperial self-sacrifice.",
        "exits": {
          "heart dilemma room": "scene_awakened_heart_dilemma",
          "final trigger": "scene_final_detonation"
        },
        "items": [],
        "npcs": [],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_contain_entity_path": {
        "id": "scene_contain_entity_path",
        "name": "Desperate Containment",
        "description": "Faced with an impossible choice, Valerius frantically formulated a complex, desperate plan of containment. It involves re-stabilizing the most volatile energy conduits around the 'Heart' and activating ancient, previously dormant stasis fields or gravitational anchors embedded within the colossal xenos structures. This is a high-wire act of technical expertise, requiring precise timing amidst the Hulk's escalating convulsions. Worse, pockets of fanatical cultists, still loyal to their shattered god, emerge from the shadows, attempting to disrupt their efforts, convinced the Kill Team seeks to silence their divine awakening.",
        "exits": {
          "heart dilemma room": "scene_awakened_heart_dilemma",
          "volatile conduit priority": "scene_containment_success_or_failure",
          "gravitational anchor priority": "scene_containment_success_or_failure"
        },
        "items": [],
        "npcs": [],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_sacrifice_escape_path": {
        "id": "scene_sacrifice_escape_path",
        "name": "The Unthinkable Bargain",
        "description": "With the 'Heart of the Leviathan' surging towards full awakening, the Kill Team devises a brutally pragmatic escape plan. One Space Marine must remain behind, condemned, to manually activate a localized failsafe or rig a focused detonation that will buy the others precious minutes to escape the collapsing Hulk. It's a bargain with damnation, trading one life for the potential salvation of the mission and a chance to report the scale of this galactic threat. The air grows heavy not just with psychic energy, but with the profound, crushing weight of an unthinkable moral calculus.",
        "exits": {
          "heart dilemma room": "scene_awakened_heart_dilemma",
          "sacrifice tyberius": "scene_escape_climax",
          "sacrifice valerius": "scene_escape_climax",
          "sacrifice lyra": "scene_escape_climax"
        },
        "items": [],
        "npcs": [],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_final_detonation": {
        "id": "scene_final_detonation",
        "name": "Oblivion's Embrace (Victory/Tragedy)",
        "description": "A blinding flash erupts from the heart of the Leviathan's Wake, swiftly followed by a cataclysmic, deafening roar that echoes through the void. The immense Space Hulk, once a monstrous testament to decay, rips itself apart. Its tortured metal groans, its organic growths rupture, and its fused ships are torn into uncountable fragments. The 'Heart of the Leviathan,' caught in the core of the explosion, is vaporized, its cosmic horror utterly annihilated, never to threaten the Segmentum or beyond. The Kill Team perishes in the conflagration, their final moments consumed by the cleansing fire, a silent, absolute sacrifice for the Imperium. No monument will stand for them, no song will be sung, but the galaxy is safe.",
        "exits": {
          "detonation point": "scene_detonate_hulk_path"
        },
        "items": [],
        "npcs": [],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_containment_success_or_failure": {
        "id": "scene_containment_success_or_failure",
        "name": "A Frail Prison (Uncertain Future)",
        "description": "Through sheer tenacity and desperate measures, the 'Heart of the Leviathan' is temporarily contained. Valerius's intricate re-stabilization of the xenos gravitational anchors and Lyra's calculated calibration of ancient stasis fields have halted its immediate, cataclysmic expansion. The chamber, though still warped and unnerving, no longer threatens to tear the Hulk apart. But the containment is fragile, a temporary reprieve. The entity's influence, though diminished, still subtly seeps, a faint, malevolent hum at the back of your mind. The Kill Team, exhausted and scarred, escapes the immediate threat, but the 'Heart' remains in its frail prison – a ticking time bomb for the Imperium, a terrifying legacy for those who survived.",
        "exits": {
          "containment attempt": "scene_contain_entity_path",
          "extraction point": "scene_escape_climax"
        },
        "items": [],
        "npcs": [],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_escape_climax": {
        "id": "scene_escape_climax",
        "name": "Desperate Flight",
        "description": "Whether having detonated the Hulk with a sacrifice, or contained the 'Heart' in a fragile prison, the surviving Kill Team members embark on a perilous escape. The Leviathan's Wake, now truly dying, convulses violently. Corridors collapse, gravity wells fluctuate wildly, and ancient mechanisms fail. Pockets of fanatical cultists, driven to suicidal zeal by the Heart's lingering psychic agony or the chaos of their god's destruction, launch desperate, last-gasp attacks. It is a race against time and inevitable collapse, a frantic struggle through environmental hazards and lingering xenos resistance towards the extraction point. Each surviving Brother is forever changed by their encounter with the void's unspeakable echo.",
        "exits": {
          "containment success": "scene_containment_success_or_failure",
          "sacrifice escape origin": "scene_sacrifice_escape_path"
        },
        "items": [],
        "npcs": [],
        "events": [],
        "dark": false,
        "locked_exits": {}
      },
      "scene_ancient_lore_clue": {
        "id": "scene_ancient_lore_clue",
        "name": "Whispers of Ancient Evils",
        "description": "As the Kill Team pursues the erratic distress beacon, Valerius's highly sensitive multi-spectral auspex detects very ancient, non-Imperial energy signatures, buried deep beneath layers of debris and fused wreckage. These readings suggest structures far older than any Imperial wreck, perhaps even pre-dating humanity's earliest interstellar voyages. Simultaneously, Lyra's xenoscanners pick up traces of complex, sophisticated xenos technology woven into the Hulk's core, entirely distinct from the crude Genestealer mechanisms. Her analysis hints at a staggering truth: the Leviathan's Wake might not just be a random collection of wrecks, but an ancient, possibly sentient vessel in itself, or a deliberate xenos construct concealing something far more profound and terrifying than a cult nest. The urgency of the distress beacon still pulls, but these new whispers promise a deeper, older evil.",
        "exits": {
          "beacon source": "scene_beacon_source",
          "original mission": "scene_first_genestealers",
          "ancient signatures": "scene_xenos_cathedral"
        },
        "items": [
          {
            "id": "artifact_ancient_device_fragment",
            "name": "Fragment of Ancient Stasis Device",
            "description": "A piece of remarkably preserved, unknown xenos technology embedded within the walls. It hums faintly and seems to distort perception.",
            "takeable": true
          }
        ],
        "npcs": [
          {
            "id": "npc_dying_xenotech_adept",
            "name": "Dying Xenotech Adept",
            "description": "A skeletal figure encased in heavily scarred Mechanicus robes, half-assimilated into a bio-organic growth. His cybernetics are twisted, but his eyes glow with a desperate intelligence.",
            "dialogue": {
              "greeting": "It... awakens... the prison holds... for now..."
            }
          }
        ],
        "events": [],
        "dark": false,
        "locked_exits": {}
      }
    },
    "global_items": {},
    "global_npcs": {},
    "endings": [
      {
        "id": "ending_detonation_sacrifice",
        "scene_id": "scene_final_detonation",
        "name": "Oblivion's Embrace",
        "description": "You and your brothers make the ultimate sacrifice, destroying the Heart of the Leviathan at the cost of your own lives. The galaxy is safe, but no one will sing your praises.",
        "ending_type": "sacrifice"
      },
      {
        "id": "ending_containment_escape",
        "scene_id": "scene_escape_climax",
        "name": "A Frail Prison: Uncertain Future",
        "description": "The Heart of the Leviathan is contained, but only temporarily. You escape, forever haunted by the threat that still slumbers, a ticking time bomb for the Imperium.",
        "ending_type": "uncertain_victory"
      },
      {
        "id": "ending_sacrifice_escape",
        "scene_id": "scene_escape_climax",
        "name": "The Unthinkable Bargain: Scarred Survival",
        "description": "One of your brothers is sacrificed to secure your escape. You live to report the threat, but the moral weight of your choice will forever haunt your triumphs.",
        "ending_type": "bitter_victory"
      }
    ]
  }
}
