{
  "prd_document": {
    "game_title": "Space Hulk: Echoes of the Void",
    "game_systems": {
      "movement": {
        "description": "Players navigate the claustrophobic corridors and vast derelict chambers of the Space Hulk from a first-person perspective. Movement is deliberately weighty and methodical, reflecting a Terminator's massive power armor. Environmental hazards (e.g., collapsed paths, live wires, vents) require tactical assessment. Limited sprint for short bursts.",
        "commands": [
          "move_forward",
          "move_backward",
          "strafe_left",
          "strafe_right",
          "interact",
          "sprint"
        ],
        "narrative_purpose": "Emphasizes the oppressive, maze-like nature of the Hulk and the heavy, powerful presence of a Terminator. Slow, deliberate movement builds tension and horror, making every step feel significant and dangerous. Environmental traversal challenges reinforce the Hulk as a character – a hostile, decaying entity."
      },
      "inventory": {
        "description": "Players manage a limited inventory of weapons, ammo, and utility items. Weapons include Bolters, Storm Bolters, Power Fists, Chainfists, and other iconic Terminator armaments. Utility items might include auspex scanners, medkits, demolition charges. Capacity is thematic, reflecting the gear a Terminator can carry, but not excessive.",
        "capacity": 8,
        "commands": [
          "equip_weapon",
          "use_item",
          "reload",
          "drop_item",
          "pick_up_item"
        ],
        "narrative_purpose": "Limited inventory reinforces the desperate survival theme and the severity of attrition. Players must make tactical choices about what gear to carry, echoing the resource scarcity of deep-space operations. Finding remnants of fallen comrades' gear (e.g., ammunition, ASTARTES relics) directly ties into 'Isolated Survival' and 'Deeper Hulk Investigation' scenes, adding emotional weight to resource acquisition."
      },
      "combat": {
        "description": "Tactical, brutal, and often overwhelming first-person combat against Genestealers. Emphasizes target prioritization, cover utilization, and managing the 'Black Rage' meter. Melee combat is powerful but risky. Ranged combat relies on accurate bursts and efficient ammo management. Genestealers attack from all angles, including vents and walls.",
        "mechanics": [
          {
            "name": "Black Rage Meter",
            "rules": "A dynamic UI element tracks Valerius's escalating Black Rage. This meter fills with prolonged combat, taking hits, or witnessing squadmates fall. As it fills, Valerius gains temporary buffs (melee damage, damage resistance) but suffers drawbacks (reduced ranged accuracy, tunnel vision, slower tactical awareness). Overfilling the meter can lead to a brief berserk state (uncontrollable melee attacks) or a 'critical rage' debuff after combat (temporary stat reduction). Players can attempt to manage the meter by conserving ammo, tactical retreats, or using specific 'calming' abilities/items (rare)."
          },
          {
            "name": "Squad Command & Morale",
            "rules": "Players can issue simple commands to Arion and Tiberius (e.g., 'Hold Position,' 'Follow,' 'Focus Fire,' 'Use Ability'). Squadmates have their own specialized abilities (Arion: psychic attacks/support, Tiberius: berserk charge/melee tank). Squad morale is influenced by Valerius's Black Rage, combat performance, and narrative choices. Low morale can lead to less effective squadmate performance or even temporary insubordination (e.g., Tiberius rushing ahead). The player can use a 'Rally' command, briefly boosting morale at a cost (e.g., small Black Rage gain for Valerius)."
          },
          {
            "name": "Environmental Interaction in Combat",
            "rules": "Players can utilize environmental elements, such as blasting compromised bulkheads to create chokepoints, activating dormant defenses (if found and repaired), or sealing vents to prevent enemy flanking. Certain objects can be destroyed to collapse paths or create temporary cover."
          }
        ],
        "narrative_purpose": "The 'Black Rage Meter' is central to Valerius's character arc, directly translating his internal struggle into a gameplay mechanic. It pressures the player to manage Valerius's sanity vs. combat effectiveness, fueling the 'Man vs. Self' conflict. Squad commands reflect Valerius's leadership role, with squad morale tying into the narrative's themes of camaraderie and the toll of the mission. Environmental combat emphasizes the Hulk's pervasive hostility and the tactical ingenuity required to survive, linking to the 'Man vs. Environment' conflict. The overwhelming odds against Genestealers reinforce the 'Man vs. Alien' horror."
      },
      "interaction": {
        "description": "Players interact with the environment, objects, and characters to progress the story, gather lore, and find resources. This includes inspecting ancient terminals, examining fallen comrades, or activating machinery.",
        "commands": [
          "examine",
          "talk",
          "use",
          "access_terminal",
          "collect"
        ],
        "narrative_purpose": "Allows players to uncover the 'Secrets of the Hulk' by interacting with data logs and ancient pict-recordings. Examining fallen comrades' dog tags (Scene 02) deepens the sense of loss and grim reality. Dialogue with Arion and Tiberius drives the 'Moral Dilemma' and character arcs, allowing Valerius to influence their perspectives, or provoke ideological clashes."
      }
    },
    "game_state": {
      "tracked_variables": [
        {
          "variable": "Valerius_BlackRage_level",
          "purpose": "Tracks current intensity of Valerius's Black Rage, influencing combat buffs/debuffs and visual/audio effects. Directly reflects his internal conflict and character arc."
        },
        {
          "variable": "Arion_Influence_level",
          "purpose": "A hidden variable reflecting Arion's susceptibility to the C'tan Shard's influence, based on player choices and interactions (e.g., encouraging his research vs. shutting him down). Affects his dialogue, abilities, and his stance in 'Moral Dilemma' scenes."
        },
        {
          "variable": "Tiberius_Rage_level",
          "purpose": "Tracks the intensity of Tiberius's Black Rage, influencing his combat aggression and dialogue. This can increase due to specific events or player decisions, reflecting his linear descent into further madness."
        },
        {
          "variable": "Lore_Fragments_Collected",
          "purpose": "Number of discovered datalogs, pict-recordings, and murals. Unlocks optional codex entries and provides context for the 'Secrets of the Hulk' plot point, enriching player understanding of the cosmic horror."
        },
        {
          "variable": "Current_Objective_Status",
          "purpose": "Tracks the main mission progress, from 'Neutralize Genestealers' to 'Retrieve Shard' to 'Deal with Shard'. Dynamically updates dialogue and available interactions."
        },
        {
          "variable": "Squad_Disposition_Arion",
          "purpose": "Reflects Arion's current attitude towards Valerius, influencing his willingness to follow commands or provide support, especially during the 'Moral Dilemma'."
        },
        {
          "variable": "Squad_Disposition_Tiberius",
          "purpose": "Reflects Tiberius's current attitude towards Valerius and Arion, influencing his combat behavior and reactions to Arion's proposals."
        }
      ],
      "win_conditions": [
        {
          "condition": "Successfully destroy the C'tan Shard through conventional means and escape the Hulk ('Standard Victory Ending')."
        },
        {
          "condition": "Activate the Doomsday Protocol, destroying the Hulk and the Shard (and the squad) ('Martyrdom Ending')."
        },
        {
          "condition": "Assist Arion in 'purifying' or 'containing' the C'tan Shard, leading to a unique outcome based on previous choices ('Heretic/Power Ending' or 'Grave Risk Ending')."
        },
        {
          "condition": "Complete the final objective and initiate extraction from the Space Hulk."
        }
      ],
      "lose_conditions": [
        {
          "condition": "Valerius's health reaches zero (player death)."
        },
        {
          "condition": "All squadmates are permanently incapacitated or killed."
        },
        {
          "condition": "Valerius succumbs entirely to the Black Rage, resulting in an uncontrollable and self-destructive frenzy leading to his death or mission failure."
        },
        {
          "condition": "Failure to complete critical timed objectives (e.g., holding a position, performing a critical repair)."
        }
      ]
    },
    "technical_requirements": [
      {
        "requirement": "Dynamic Lighting and Shadow System",
        "justification": "Essential for creating a claustrophobic, horror atmosphere within the Hulk's dark corridors. Key for visual storytelling, highlighting enemies, and environmental hazards that support the 'Man vs. Environment' and 'Man vs. Alien' conflicts."
      },
      {
        "requirement": "Advanced AI for Genestealers (pathfinding, perception, coordinated attacks)",
        "justification": "Required for creating believable, terrifying, and tactically challenging encounters that reflect the cunning of the Tyranid Hive Mind and Patriarch. Crucial for supporting the 'Man vs. Alien' conflict and the sense of being hunted."
      },
      {
        "requirement": "Robust Dialogue and Choice Branching System",
        "justification": "Integral for implementing the 'Moral Dilemma' scenes, tracking player choices, and influencing character arcs (especially Arion) and the ultimate ending. Supports the 'Ideological/Moral Conflict' and 'Man vs. Self' themes."
      },
      {
        "requirement": "Particle and Post-Processing Effects for Black Rage",
        "justification": "Visual and audio cues (e.g., red tint, distorted sounds, vignette) are necessary to convey the escalating intensity of Valerius's Black Rage, making the internal conflict tangible to the player and enhancing immersion."
      },
      {
        "requirement": "Complex Environmental Interaction System",
        "justification": "Allows players to dynamically affect the battleground (e.g., sealing vents, activating ancient tech), vital for tactical gameplay, and reinforces the Hulk as an active, hostile entity as per 'Man vs. Environment'."
      }
    ]
  }
}
