{
  "prd_document": {
    "game_title": "Terminus: Echoes of the Void",
    "game_systems": {
      "movement": {
        "description": "Players navigate the Space Hulk through a combination of standard infantry movement (walking, running), tactical dashing/vaulting over debris, and zero-gravity maneuvering using magnetic boots and occasional jetpack bursts in depressurized zones. Certain areas allow for environmental traversal like climbing or rappelling.",
        "commands": [
          "W/A/S/D (Move)",
          "Shift (Run/Dash)",
          "Space (Vault/Jump/Boost in Zero-G)",
          "C (Crouch)",
          "Ctrl (Magnetic Boots Toggle in Zero-G)"
        ],
        "narrative_purpose": "Movement is designed to reinforce the claustrophobic, hazardous, and unpredictable nature of the Space Hulk. Zero-gravity segments create tension and vulnerability, emphasizing the alien environment and the Kill Team's adaptability. Tactical dashing allows for moments of desperate escape or aggressive closure, reflecting the 'survival against impossible odds' theme. Environmental traversal highlights the decaying, labyrinthine structure, reinforcing the 'Man vs. Environment' conflict and the sense of being trapped."
      },
      "inventory": {
        "description": "Each Space Marine has a limited personal inventory for weapons, ammunition, grenades, and mission-critical items. Specialized items (e.g., Valerius's auspex, Lyra's narthecium) occupy dedicated slots. Capacity is restrictive per Marine, encouraging teamwork and resource management.",
        "capacity": "Limited (Varies per Marine by role, e.g., Tyberius carries more ammo, Lyra utility items), encouraging difficult choices about what to carry. Shared reserves are accessible at designated points.",
        "commands": [
          "'I' (Open Inventory)",
          "'Left-Click' (Select/Use Item)",
          "'Right-Click' (Inspect Item)",
          "'Drag & Drop' (Transfer between Marines/Stash)"
        ],
        "narrative_purpose": "The limited inventory emphasizes the 'survival against impossible odds' and 'resource scarcity' themes. Players must make tactical decisions about loadouts before missions and on the fly, reflecting the grim reality of Deathwatch operations deep behind enemy lines. Retrieving specific items or archeotech becomes more impactful due to the inventory constraints, tying directly into plot points like 'Retrieving Imperial artifacts' or 'Analyzing xenos tech' while highlighting the strategic decision-making of the Kill Team."
      },
      "combat": {
        "description": "Real-time tactical combat with a pause-and-plan system. Players control a squad of 1-4 Space Marines, issuing commands for movement, targeting, special abilities, and overwatch. Cover is critical, and enemy types necessitate varied tactical approaches. 'Stress' and 'Morale' mechanics affect combat effectiveness.",
        "mechanics": [
          {
            "name": "Tactical Pause / Command Wheel",
            "rules": "During combat, players can pause the action (or slow it significantly) to issue precise commands to each Kill Team member via a radial menu. This includes target prioritization, ability activation, movement orders, and cover assignments. This allows for strategic depth despite the real-time nature."
          },
          {
            "name": "Cover System",
            "rules": "Environmental objects provide soft or hard cover, reducing incoming damage and breaking line of sight. Utilizing cover effectively is paramount for survival. Enemies also use cover."
          },
          {
            "name": "Overwatch / Suppressive Fire",
            "rules": "Marines can be ordered to enter 'Overwatch' mode, firing on any enemy that enters their cone of vision. Suppressive Fire can pin down enemies, reducing their accuracy and movement."
          },
          {
            "name": "Character Abilities & Synergy",
            "rules": "Each Marine has unique, cooldown-based abilities reflecting their Chapter and role (e.g., Kaelen's 'Tactical Command,' Valerius's 'Omnissian Blessing,' Tyberius's 'Furious Charge,' Lyra's 'Narthecium Heal' or 'Xenos Weakness Analysis'). Synergistic use of these abilities is crucial."
          },
          {
            "name": "Stress & Morale",
            "rules": "Marines accumulate 'Stress' from sustained combat, witnessing horrors, or taking heavy damage. High stress can lead to 'Morale Breaks' (temporary debuffs like reduced accuracy, panic, or even the manifestation of the 'Red Thirst' for Tyberius), reflecting inner conflicts and the psychological toll of the mission. Lyra's abilities can help manage stress."
          }
        ],
        "narrative_purpose": "Combat mechanically supports the 'Grimdark' and 'Action-Horror' tone. The Tactical Pause emphasizes the Kill Team's strategic superiority but also the need for calculated risk in the face of overwhelming odds. Cover system and Overwatch reflect realistic, brutal engagements against numerically superior foes, reinforcing 'Survival against impossible odds.' Character Abilities directly tie into individual character arcs and Chapter lore (e.g., Tyberius's Red Thirst mechanic for his arc development, Valerius's tech-focused abilities for his pragmatism). The Stress & Morale system directly portrays the 'Internal (Character) Conflict' and 'The corrupting influence/horror of the unknown,' forcing players to truly feel the psychological pressure on their Marines."
      },
      "interaction": {
        "description": "Players interact with the environment, objects, and characters. This includes examining points of interest, hacking terminals, opening doors, activating machinery, collecting resources, initiating dialogue, and making narrative choices.",
        "commands": [
          "'E' (Interact/Examine)",
          "'F' (Toggle Flashlight)",
          "'Q' (Quick Talk to nearest Teammate)"
        ],
        "narrative_purpose": "Interaction drives the narrative forward and deepens immersion. 'Examine' allows for discovery of narrative clues (e.g., fragmented logs, xenos glyphs for plot points 2 & 3). Hacking/activating machinery (often Valerius's role) reinforces his pragmatism and reliance on technology. Dialogue with squad members serves 'Internal (Character) Conflict' and 'Ideological Conflict', exposing their distinct perspectives and emotional responses to the unfolding horror. Narrative choices, presented via dialogue or contextual prompts, are the primary mechanism for player agency in shaping character arcs and plot outcomes (e.g., the 'Moral Crucible' decision point)."
      },
      "choice_and_consequence": {
        "description": "Throughout the game, players are presented with significant narrative decisions, often with no clear 'right' answer. These choices impact character relationships, access to information, tactical advantages/disadvantages, and ultimately lead to different narrative paths and endings.",
        "commands": ["'1', '2', '3' (Select Dialogue/Action Option)"],
        "narrative_purpose": "This is the core mechanic for 'Moral Crucible' and 'Sacrifice vs. self-preservation' themes. It directly enables player agency in shaping the character arcs (e.g., Kaelen's adherence to protocol vs. pragmatic action; Valerius's approach to unknown tech; Tyberius's fury; Lyra's scientific curiosity). Decisions determine which 'Narrative Map' connections are taken, leading to alternate scenes and ultimately different endings (plot points 5 & 6), directly reflecting the 'grimdark' tone where decisions are hard and consequences are severe."
      },
      "resource_management": {
        "description": "Beyond inventory, players manage broader resources like remaining ammunition, medical supplies, and squad integrity (health, stress levels). Certain actions (e.g., Lyra's complex medical procedures) consume specific resources or time.",
        "commands": [
          "No direct command, contextual management through inventory and ability use"
        ],
        "narrative_purpose": "Reinforces the 'Survival against impossible odds' and 'Resource Scarcity' themes. Managing limited resources creates continuous tension and forces hard choices, especially when medical supplies are low or ammunition runs out in critical moments. This ties into the 'Time Constraint' by making players weigh the cost of every action."
      }
    },
    "game_state": {
      "tracked_variables": [
        {
          "variable": "kill_team_morale",
          "purpose": "Represents the overall psychological state of the squad, influenced by individual Marine stress levels, recent losses, and narrative events. Affects combat performance and dialogue."
        },
        {
          "variable": "heart_awakening_progress",
          "purpose": "A hidden timer/meter representing how close 'The Heart of the Leviathan' is to fully awakening. Influenced by player actions (e.g., delay tactics vs. direct assault), cultist rituals. Directly impacts which ending paths are available."
        },
        {
          "variable": "character_loyalty_kaelen",
          "purpose": "Tracks Kaelen's adherence to formal protocol versus his grudging acceptance of more pragmatic/unorthodox methods. Influences his dialogue and specific leadership abilities."
        },
        {
          "variable": "character_loyalty_valerius",
          "purpose": "Tracks Valerius's trust in pure logic/tech vs. his exposure to and acceptance of unquantifiable cosmic horror. Affects his analytical abilities and willingness to interact with certain xenos tech."
        },
        {
          "variable": "character_loyalty_tyberius",
          "purpose": "Tracks Tyberius's struggle with the Red Thirst, influenced by combat intensity and psychic exposure. Affects his combat effectiveness and risk of 'Black Rage' episodes."
        },
        {
          "variable": "character_loyalty_lyra",
          "purpose": "Tracks Lyra's scientific curiosity vs. her horror and duty, influenced by xenos discoveries. Affects her medical efficacy and ability to analyze xenos threats."
        },
        {
          "variable": "discovered_lore_fragments",
          "purpose": "Counts the number of lore fragments, data logs, or xenos glyphs discovered. Unlocks deeper understanding of the plot and potential tactical advantages (e.g. enemy weaknesses)."
        },
        {
          "variable": "cultist_strength_modifier",
          "purpose": "Dynamic variable affecting Genestealer cultist numbers and aggression, influenced by player actions (e.g., stealth vs. loud approach, disrupting rituals). Directly relates to the 'Man vs. Xenos' conflict."
        }
      ],
      "win_conditions": [
        {
          "condition": "Successfully destroy 'The Heart of the Leviathan' through a self-sacrificial detonation of the Space Hulk (The Ragnarok Protocol)."
        },
        {
          "condition": "Successfully contain 'The Heart of the Leviathan' within the Space Hulk, ensuring its temporary neutralization and escaping with the team."
        },
        {
          "condition": "Successfully escape the Space Hulk after making a critical sacrifice to buy time, allowing for strategic retreat and reporting the threat to the Imperium."
        }
      ],
      "lose_conditions": [
        {
          "condition": "All Space Marines in the Kill Team are incapacitated or killed in action."
        },
        {
          "condition": "'The Heart of the Leviathan' fully awakens and escapes containment, triggering a catastrophic sector-wide event (game-over)."
        },
        {
          "condition": "Failure to complete primary mission objectives within the narrative's unspoken time constraints (e.g., cultists complete a critical ritual without intervention)."
        }
      ]
    },
    "technical_requirements": [
      {
        "requirement": "Dynamic environment destruction and deformation system.",
        "justification": "To visually represent the Space Hulk's decay, structural weaknesses, and the awakening of 'The Heart of the Leviathan,' enhancing immersion and narrative impact (Man vs. Environment conflict)."
      },
      {
        "requirement": "Advanced AI for squad members and enemies, including pathfinding for zero-gravity and complex tactical behaviors.",
        "justification": "Crucial for realistic tactical combat, ensuring squad members respond intelligently to commands, and enemies provide a challenging, unpredictable threat (Man vs. Xenos conflict)."
      },
      {
        "requirement": "Decision-making engine that tracks player choices and variables, branching narrative paths and multiple endings.",
        "justification": "Essential for delivering on 'Moral Crucible' and 'Choice & Consequence' narratives, ensuring player agency significantly impacts the story and character arcs."
      },
      {
        "requirement": "Rich audio design with spatialized sound for creaking metal, distant roars, psychic whispers, and zero-G silence.",
        "justification": "To reinforce the claustrophobic, horror atmosphere and the psychological impact of the 'The corrupting influence / horror of the unknown' theme."
      },
      {
        "requirement": "Robust character progression system with skill trees that reflect individual character arcs and decision impact.",
        "justification": "To give tangible meaning to player choices and character development, allowing the mechanical systems to reflect the narrative changes in Kaelen, Valerius, Tyberius, and Lyra. For example, Kaelen's 'Tactical Command' may branch into 'Strict Protocol' or 'Adaptive Tactics' based on his arc."
      }
    ]
  }
}
