{
  "puzzle_design": {
    "puzzles": [
      {
        "id": "puzzle_breach_stabilization",
        "name": "Thunderhawk Breach Stabilization",
        "description": "After breaching the Space Hulk, the Thunderhawk's hull integrity is compromised, and auxiliary systems are failing. The Kill Team must quickly reroute power and seal critical breaches before decompression or system failure becomes critical. This emphasizes Valerius's technical skill and Kaelen's demand for protocol.",
        "location": "scene_hulk_breach",
        "narrative_purpose": "Introduces immediate environmental hazards and tests the team's ability to react under pressure. Highlights Valerius's pragmatism and Kaelen's focus on procedure. Sets the claustrophobic and dangerous tone of the hulk.",
        "solution": {
          "type": "mini-game_system_repair",
          "steps": [
            "Valerius identifies three critical system failures (e.g., primary power conduit severed, life support pressure drop, comms array offline).",
            "Player chooses which system to prioritize based on Kaelen's directives (e.g., seal breach first for immediate survival) or Valerius's analytical assessment (e.g., restore comms for external contact).",
            "Each system requires a quick sequence of button presses or a matching mini-game to reroute power/seal breaches, possibly with Tyberius physically bracing failing systems and Lyra providing emergency medical aid for minor injuries sustained."
          ]
        },
        "difficulty": "medium"
      },
      {
        "id": "puzzle_ancient_glyph_decipher",
        "name": "Whispers of Eldritch Lore",
        "description": "In 'scene_ancient_lore_clue' or 'scene_xenos_cathedral', the team encounters walls covered with complex, pulsating xenos glyphs. Lyra believes they hold vital information about the cult or the Heart of the Leviathan, but they defy known xenos languages.",
        "location": "scene_ancient_lore_clue",
        "narrative_purpose": "Emphasizes Lyra's scientific curiosity and intellectual prowess, potentially bordering on heresy. Provides narrative exposition about the true nature of the 'Heart' or the cult's motives. Serves as a branching point in the story, influencing whether the team focuses on immediate threats or deeper mysteries.",
        "solution": {
          "type": "logic_deciphering",
          "steps": [
            "Lyra uses her auspex and xeno-data-slates to scan glowing glyphs, revealing patterns or echoes of meaning.",
            "Player identifies repeating symbols or sequences (e.g., 'awakening', 'devour', 'god', 'truth') from a selection of fragmented options displayed.",
            "Successful identification of key symbols (based on context clues from previous logs/observations) allows Lyra to piece together a fragmented warning or prophecy about the Heart's true nature or the Patriarch's ultimate goal. Valerius can assist by cross-referencing energy signatures."
          ]
        },
        "difficulty": "medium"
      },
      {
        "id": "puzzle_cult_ritual_interruption",
        "name": "Disrupting the Awakening",
        "description": "In 'scene_xenos_cathedral', the Genestealer Cult is performing a ritual around the dormant 'Heart'. The team needs to disrupt the ritual without triggering a full, overwhelming cultist response.",
        "location": "scene_xenos_cathedral",
        "narrative_purpose": "Provides a tactical challenge that blends stealth and combat. Highlights Kaelen's strategic thinking and the need for coordinated team effort. The outcome affects the difficulty of the subsequent 'Confronting the Patriarch' encounter.",
        "solution": {
          "type": "stealth_or_tactical_assault",
          "steps": [
            "Player chooses between stealth (Kaelen's preference for tactical advantage) or direct assault (Tyberius's inclination).",
            "Stealth Path: Team navigates through cultist patrols using environmental cover, disabling key ritual components (e.g., bio-luminescent totems, psychic amplifiers) that empower the ritual. Requires timing and awareness checks. Failure results in immediate combat with alerted cultists.",
            "Direct Assault Path: Initiates a multi-wave combat encounter where the team must rapidly eliminate cultists while dealing with environmental hazards (e.g., psychic feedback from ritual components). Prioritizing key cultists (e.g., Magus, Primus) can disrupt the ritual faster."
          ]
        },
        "difficulty": "hard"
      }
    ],
    "artifacts": [
      {
        "id": "artifact_commissar_log",
        "name": "Commissar's Doomed Log-Vox",
        "description": "A partially scorched and damaged Imperial log-vox module, recovered from the derelict voidship in 'scene_derelict_expedition'. It contains the last, frantic recordings of a Commissar who witnessed the awakening horror.",
        "location": "scene_derelict_expedition",
        "narrative_significance": "Provides direct narrative exposition from a human (Imperial) perspective, reinforcing the theme of 'unseen horror' and 'whispers from within'. The Commissar's descent into despair and eventual implied corruption or death foreshadows the true nature of the Heart and the moral crucible. Fuels Lyra's narrative investigation or Valerius's tactical assessment of threat amplification.",
        "properties": [
          {
            "property_type": "Data Logs",
            "value": "Fragmented audio/text entries detailing initial encounter with cult, growing paranoia, mention of 'the whispers', increasing loss of Imperial morale, and a final, garbled transmission about 'a colossal eye that sees all'."
          },
          {
            "property_type": "Corrupted Data",
            "value": "A small portion of the log is warped by xenos influence, making it difficult to fully decrypt without Lyra's expertise."
          }
        ]
      },
      {
        "id": "artifact_xenos_psy_amplifier",
        "name": "Xenos Psychic Amplifier Shard",
        "description": "A crystalline shard found near the Genestealer cult's ritual grounds, pulsating faintly with captured psychic energy. It feels unnerving to touch, subtly projecting alien thoughts.",
        "location": "scene_xenos_cathedral",
        "narrative_significance": "Reveals insight into the Patriarch's psychic abilities and the cult's methods of amplifying the Heart's influence. Lyra can study it for vulnerabilities or insights into xenos bio-psychics, while Valerius might try to analyze its energy signature. Presents a potential tactical weakness or understanding of the enemy within 'scene_confront_patron'.",
        "properties": [
          {
            "property_type": "Psychic Resonance",
            "value": "Slightly interferes with internal comms and causes minor headaches to non-psykers."
          },
          {
            "property_type": "Bio-Energy Signature",
            "value": "Analysis by Lyra reveals it's composed of organic and synthetic compounds, enhancing localized psychic fields like a lens focusing light."
          },
          {
            "property_type": "Fragility",
            "value": "Can be destroyed to temporarily disrupt small cultist psychic abilities or communication."
          }
        ]
      },
      {
        "id": "artifact_ancient_device_fragment",
        "name": "Fragment of Ancient Stasis Device",
        "description": "A piece of remarkably preserved, unknown xenos technology embedded within the walls of 'scene_ancient_lore_clue'. It hums faintly and seems to distort perception, suggesting a long-dormant containment or temporal manipulation function.",
        "location": "scene_ancient_lore_clue",
        "narrative_significance": "Introduces the possibility of ancient containment, directly relevant to the 'Contain the Heart' path ('scene_contain_entity_path'). Its discovery by Valerius reinforces his arc by presenting a technological solution to an impossible problem. Provides a tangible link to the 'Echoes of the Past' plot point and deepens the mystery of the hulk.",
        "properties": [
          {
            "property_type": "Energy Signature",
            "value": "Valerius can analyze its unique energy output, identifying it as a highly advanced gravimetric or stasis field generator component."
          },
          {
            "property_type": "Corrosion Resistance",
            "value": "Shows incredible resilience to the corrosive environment of the hulk."
          },
          {
            "property_type": "Schematics Fragment",
            "value": "Valerius can extract partial schematics, suggesting how ancient containment fields might work, crucial for 'scene_contain_entity_path' options later."
          }
        ]
      }
    ],
    "monsters": [
      {
        "id": "monster_genestealer_hybrid_alpha",
        "name": "Genestealer Hybrid Alpha",
        "description": "A larger, stronger, and more cunning Genestealer Hybrid (typically 2nd or 3rd generation) encountered among the first wave of attackers. It displays rudimentary tactical intelligence, coordinating smaller Hybrids.",
        "locations": [
          "scene_first_genestealers",
          "scene_xenos_cathedral"
        ],
        "narrative_role": "Serves as a mini-boss in early combat encounters, making the Genestealer threat feel more organized and intelligent than simple feral beasts. Reinforces Kaelen's initial underestimation of the cult and forces Tyberius to push his combat prowess. Provides a tactical challenge beyond mere mob encounters.",
        "abilities": [
          "Coordinated Strike (calls in flanking lesser Hybrids)",
          "Enhanced Claws (high melee damage)",
          "Thick Carapace (minor damage resistance)",
          "Psionic Scream (briefly disorients nearby targets)"
        ]
      },
      {
        "id": "monster_psychic_cult_magus",
        "name": "Psionic Cult Magus",
        "description": "A leading member of the Genestealer Cult, gifted with potent psychic abilities by the Patriarch. Often a 4th generation Hybrid, appearing outwardly human but with subtle xenos mutations and a disturbing zealousness.",
        "locations": [
          "scene_xenos_cathedral",
          "scene_confront_patron"
        ],
        "narrative_role": "Directly links the cult's activities to the broader psychic influence of the 'Heart' and the Patriarch. Acts as an early source of psychic opposition, something the Space Marines are not inherently prepared for. Lyra can study its psychic signature as part of 'Whispers of Eldritch Lore' puzzle. Its defeat weakens the ritual's effectiveness.",
        "abilities": [
          "Mind Scour (deals moderate psychic damage, debuffs accuracy)",
          "Frenzied Zeal (buffs nearby cultists' attack and defense)",
          "Warp Shield (briefly deflects ranged attacks)",
          "Psychic Anchor (creates a psychic nexus that cultists draw strength from until destroyed)"
        ]
      },
      {
        "id": "monster_gloom_stalker",
        "name": "Gloom Stalker (Lurking Horror)",
        "description": "Not a Genestealer, but a creature native to the deeper, more corrupted parts of the Space Hulk. It's a multi-limbed, chitinous predator adapted to zero-gravity and extreme darkness, often attacking from unexpected angles.",
        "locations": [
          "scene_beacon_source",
          "scene_derelict_expedition",
          "scene_detonate_hulk_path"
        ],
        "narrative_role": "Reinforces the 'Man vs. Environment' theme. Introduces an unexpected, non-cultist threat that relies on environmental advantages, forcing Valerius to utilize environmental scanning and Kaelen to adapt tactics. Represents the general pervasive horror and danger of the Space Hulk itself, separate from conscious xenos plotting.",
        "abilities": [
          "Ambush Predator (high first-strike bonus from stealth)",
          "Void Claws (bypasses armor, causes bleed)",
          "Grapple (drags a target into darkness or hazardous areas)",
          "Chitinous Camouflage (difficult to detect in low light/zero-G until it attacks)"
        ]
      }
    ],
    "npcs": [
      {
        "id": "npc_dead_servicitor",
        "name": "Malfunctioning Servitor (Scout)",
        "role": "Remains of an Imperial Servitor from a previous expedition, still broadcasting corrupted data. Its function was likely reconnaissance.",
        "description": "A partially intact, heavily damaged Imperial servitor found slumped against a console, flickering with failing diagnostic lights. Its internal vox-caster crackles with fragmented, looping data packets and distress signals.",
        "locations": [
          "scene_derelict_expedition"
        ],
        "dialogue_themes": [
          "Echoes of the Lost",
          "Fragments of data about 'the whispers'",
          "Locations of other failed Imperial assets",
          "Corrupted Imperial protocols"
        ]
      },
      {
        "id": "npc_cult_disciple_zealot",
        "name": "Cult Disciple Zealot",
        "role": "A fanatical human cultist, completely consumed by devotion to the Patriarch and the 'Heart'. Easily manipulated but fiercely protective of sacred sites.",
        "description": "A gaunt, wild-eyed figure, crudely armored and wielding improvised bladed weapons. Its eyes burn with an unnatural fervor, and it mutters low, guttural blessings to its alien god.",
        "locations": [
          "scene_first_genestealers",
          "scene_xenos_cathedral"
        ],
        "dialogue_themes": [
          "Blind devotion and fanaticism",
          "Prophecies of the 'Star-God's' awakening",
          "Hatred for the 'false Emperor' and unbelievers",
          "The 'Heart' as source of life and truth"
        ]
      },
      {
        "id": "npc_dying_xenotech_adept",
        "name": "Dying Xenotech Adept",
        "role": "A member of a previous, doomed tech-priest expedition, discovered barely clinging to life. He holds vital but fragmented information.",
        "description": "A skeletal figure encased in heavily scarred Mechanicus robes, half-assimilated into a bio-organic growth. His cybernetics are twisted, but his eyes glow with a desperate intelligence. He has a few moments of clarity before succumbing.",
        "locations": [
          "scene_ancient_lore_clue",
          "scene_xenos_cathedral"
        ],
        "dialogue_themes": [
          "The scale of the 'Heart's' influence",
          "Warnings about psychic corruption",
          "The true age and nature of the xenos structures",
          "Fragments of data on ancient 'containment schema' (linking to 'artifact_ancient_device_fragment')"
        ]
      }
    ]
  }
}
