{
  "puzzle_design": {
    "puzzles": [
      {
        "id": "puz_001_debris_clearance",
        "name": "Corridor Alpha Debris Clearance",
        "description": "A section of Corridor Alpha is heavily damaged and blocked by twisted metal, structural components, and Tyranid bio-matter. The squad needs to find a way to safely clear a path without causing a further collapse.",
        "location": "scene_002_corridor_alpha",
        "narrative_purpose": "Introduces basic environmental navigation challenges and reinforces the 'Man vs. Environment' theme. Highlights Brother Tiberius's technical skill and Valerius's tactical assessment by requiring observation of structural integrity before proceeding. Represents the claustrophobic nature of the Space Hulk.",
        "solution": {
          "type": "environmental_interaction_and_skill_check",
          "steps": [
            "Player identifies critical structural supports. (Tiberius's expertise)",
            "Player uses heavy weapon or demolition charge to precisely clear debris without compromising surrounding structure. (Tiberius's ability or Raphael's command)",
            "Alternatively, discover a hidden maintenance passage around the main blockage. (Exploration)"
          ]
        },
        "difficulty": "easy"
      },
      {
        "id": "puz_002_data_slate_decryption",
        "name": "First Squad's Data-Slate Decryption",
        "description": "Among the gruesome remains of First Squad, a battered but intact data-slate is found. It's heavily encrypted with Imperial military protocols and partially corrupted by Tyranid bio-interference, requiring precise access to retrieve its contents.",
        "location": "scene_003_first_squad_fate",
        "narrative_purpose": "This puzzle directly addresses the 'dp_first_squad_data' decision point through gameplay. Resolving it successfully provides critical narrative information ('plot2_lost_contact' and early hints of 'The Anathema''s nature) and reinforces the grim reality of the mission. Failure or a rushed attempt might yield corrupted or partial information, impacting later missions.",
        "solution": {
          "type": "timed_sequence_or_logic_gate",
          "steps": [
            "Initiate decryption protocol (player choice).",
            "Solve a short logic puzzle to bypass initial Imperial encryption (represents Brother Tiberius's tech-savvy support).",
            "Maneuver through a bio-interference 'mini-game' to stabilize data streams, avoiding complete corruption (represents the ongoing struggle against Tyranid influence).",
            "Extract log entries and astropathic fragments about 'The Anathema' and First Squad's last moments."
          ]
        },
        "difficulty": "medium"
      },
      {
        "id": "puz_003_reactor_reroute",
        "name": "Unstable Reactor Core Reroute",
        "description": "In the Restricted Sector, the primary power conduit to a vital bulkhead door is unstable due to warp-taint and Tyranid bio-growth. It requires the squad to manually reroute power through secondary, often compromised, relays or bypass safe-guards to operate the door.",
        "location": "scene_004_restricted_sector",
        "narrative_purpose": "Connects to the 'Man vs. Environment' conflict and the 'plot4_moral_dilemma' if a rescue is chosen. Failure might cause environmental hazards (e.g., radiation leaks, minor explosions) or alert nearby Tyranids, increasing tactical difficulty. Emphasizes Tiberius's role in engineering solutions and Valerius's caution.",
        "solution": {
          "type": "environmental_manipulation_and_consequence",
          "steps": [
            "Locate multiple damaged power relays in the vicinity.",
            "Choose which relays to repair/bypass, balancing risk of energy discharge vs. time/resources.",
            "Manually override the door's safety protocols, potentially requiring specific sequence input.",
            "If rescuing personnel, a successful reroute enables access; a partial success might only open a dangerous path."
          ]
        },
        "difficulty": "medium"
      }
    ],
    "artifacts": [
      {
        "id": "artf_001_first_squad_data_slate",
        "name": "First Squad's Data-Slate",
        "description": "A standard-issue Blood Angels data-slate, encased in plasti-steel, with several impact fractures and a faint, sickly purple luminescence emanating from its cracks. Its contents are encrypted and partially corrupted by xenos bio-signatures.",
        "location": "scene_003_first_squad_fate",
        "narrative_significance": "Crucial for 'plot2_lost_contact'. Retrieving and decrypting this artifact provides information about 'The Anathema's' location and nature, the initial First Squad engagement, and potentially early warnings about the Genestealer Patriarch, directly influencing 'dp_first_squad_data'. It serves as a grim memento of their fallen comrades and reinforces the stakes.",
        "properties": [
          "Encrypted Tactical Data",
          "Corrupted Astropathic Scans",
          "Location of 'The Anathema' (if fully decrypted)",
          "Last known combat logs of First Squad"
        ]
      },
      {
        "id": "artf_002_the_anathema",
        "name": "The Anathema",
        "description": "A grotesque bio-artifact pulsing with dark psychic energy, resembling a fusion of an enormous, crystalline xenos organism and corrupted Ancient Terran technology. It is partially embedded within a massive organic growth, continually siphoning energy and radiating a palpable sense of dread.",
        "location": "scene_005_hive_mind_presence / scene_006_confrontation / scene_007_final_choice",
        "narrative_significance": "This is the central MacGuffin of the entire mission, directly tied to 'plot1_initial_contact', 'plot3_the_hive_mind_awakens', and 'plot5_confrontation_and_choice'. It is the reason the Terminators are on the Hulk, and the ultimate decision regarding its fate drives the final act of the narrative. It embodies the 'cosmic horror' theme and the difficult moral choices Raphael must make.",
        "properties": [
          "Potent Psychic Emitter",
          "Tyranid Synapse Beacon (Potential)",
          "Attracts Hive Fleet organisms",
          "Structurally destabilizes Space Hulk upon violent destruction",
          "Biological/Technological Hybrid (Xenos origin)"
        ]
      }
    ],
    "monsters": [
      {
        "id": "mon_001_genestealer",
        "name": "Genestealer",
        "description": "Iconic multi-limbed xenos predators with razor-sharp claws, chitinous armor, and preternatural speed. They are the vanguard of the Tyranid Hive Fleets, infesting worlds from within.",
        "locations": [
          "scene_003_first_squad_fate",
          "scene_004_1_rescue_attempt",
          "scene_005_hive_mind_presence",
          "scene_006_confrontation",
          "scene_008_extraction_destroy",
          "scene_008_extraction_retrieve"
        ],
        "narrative_role": "The primary combat antagonist, embodying the 'Man vs. Alien' conflict and the pervasive nature of the infestation. Their presence escalates from initial skirmishes to overwhelming hordes, reflecting the growth of the Hive Mind's presence ('plot3_the_hive_mind_awakens').",
        "abilities": [
          "Blinding Charge",
          "Render Claws (armor penetration)",
          "Feeder Tendrils (psychic dampening)",
          "Stealth Ambush"
        ]
      },
      {
        "id": "mon_002_broodlord",
        "name": "Broodlord",
        "description": "A larger, more cunning variant of the Genestealer, possessing enhanced psychic abilities and leading smaller broods. Its presence signifies a more organized and dangerous element of the infestation.",
        "locations": [
          "scene_003_first_squad_fate",
          "scene_005_hive_mind_presence",
          "scene_006_confrontation"
        ],
        "narrative_role": "Serves as a mini-boss or elite enemy. Its increased intelligence and psychic capabilities demonstrate the escalating threat of the Tyranid infestation and the growing influence of the Genestealer Patriarch, contributing to 'plot3_the_hive_mind_awakens'. It challenges squad tactics and individual resilience.",
        "abilities": [
          "Mind Control (temporary squad disorientation)",
          "Psychic Scream",
          "Crushing Claws (heavy damage)",
          "Brood Telepathy (coordinates nearby Genestealers)"
        ]
      },
      {
        "id": "mon_003_tyranid_assimilator_growth",
        "name": "Tyranid Assimilator Growth (Environmental Threat)",
        "description": "A stationary or slow-moving mass of Tyranid bio-matter that actively consumes and structurally destabilizes the Space Hulk, creating new organic pathways or blocking existing ones. It might release minor bio-organisms.",
        "locations": [
          "scene_002_corridor_alpha",
          "scene_003_first_squad_fate",
          "scene_004_restricted_sector",
          "scene_005_hive_mind_presence"
        ],
        "narrative_role": "This entity directly represents the 'Man vs. Environment' conflict and the 'plot3_the_hive_mind_awakens' as the Hulk becomes consumed. It functions as an environmental hazard, forcing players to find alternative routes or destroy its vulnerable points, often triggering smaller enemies. It showcases the horrifying biological transformation of the Space Hulk.",
        "abilities": [
          "Structural Erosion",
          "Spores Release (obscures vision)",
          "Spawning Sacs (releases weaker enemies)",
          "Bio-acid Spray"
        ]
      },
      {
        "id": "mon_004_genestealer_patriarch",
        "name": "Genestealer Patriarch",
        "description": "The colossal, grotesque psychic cornerstone of the Genestealer Cult within the Hulk. It is a terrifying intellect and a physical powerhouse, radiating malevolent psychic influence and surrounded by its most devout progeny.",
        "locations": [
          "scene_006_confrontation"
        ],
        "narrative_role": "The ultimate physical antagonist, central to 'plot5_confrontation_and_choice'. Its defeat (or bypass) allows access to 'The Anathema'. The fight represents the climax of the 'Man vs. Alien' conflict and tests Raphael's leadership and the squad's cohesion under immense psychic pressure and physical threat. It embodies the 'futility of faith' theme as the ultimate xenos abomination.",
        "abilities": [
          "Psychic Domination (mind-shatter, disorient foes)",
          "Massive Crushing Attacks",
          "Synaptic Link (buffs nearby Genestealers)",
          "Bio-electric Feedback (stuns on melee hit)",
          "Adaptive Regeneration"
        ]
      }
    ],
    "npcs": [
      {
        "id": "npc_001_valerius",
        "name": "Brother-Sergeant Valerius",
        "role": "Squad Mate / Tactical Advisor",
        "description": "An experienced and pragmatic Terminator, Valerius is Raphael's second-in-command. He's seen countless horrors and approaches every situation with a grizzled but reliable logic, often tempering zeal with practicality.",
        "locations": [
          "scene_001_insertion",
          "scene_002_corridor_alpha",
          "scene_003_first_squad_fate",
          "scene_004_restricted_sector",
          "scene_004_1_rescue_attempt",
          "scene_005_hive_mind_presence",
          "scene_006_confrontation",
          "scene_007_final_choice",
          "scene_008_extraction_destroy",
          "scene_008_extraction_retrieve",
          "scene_009_escape_or_doom"
        ],
        "dialogue_themes": [
          "Tactical Assessment",
          "Pragmatism vs. Idealism",
          "Warnings of Escalating Threat",
          "Squad Cohesion",
          "Loyalty to Raphael"
        ]
      },
      {
        "id": "npc_002_claudius",
        "name": "Brother Claudius",
        "role": "Squad Mate / Zealous Warrior",
        "description": "A younger Terminator, filled with fervent zeal and eagerness to prove himself. His faith is his shield, but the grim reality of the Space Hulk begins to test his resolve and sometimes leads to reckless conviction.",
        "locations": [
          "scene_001_insertion",
          "scene_002_corridor_alpha",
          "scene_003_first_squad_fate",
          "scene_004_restricted_sector",
          "scene_004_1_rescue_attempt",
          "scene_005_hive_mind_presence",
          "scene_006_confrontation",
          "scene_007_final_choice",
          "scene_008_extraction_destroy",
          "scene_008_extraction_retrieve",
          "scene_009_escape_or_doom"
        ],
        "dialogue_themes": [
          "Imperial Faith",
          "Anti-Xenos Zeal",
          "Struggle Against Horror",
          "Redemption and Sacrifice",
          "Impact of Witnessing Atrocities"
        ]
      },
      {
        "id": "npc_003_tiberius",
        "name": "Brother Tiberius",
        "role": "Squad Mate / Technical Specialist & Heavy Weapons Expert",
        "description": "Quiet and observant, Tiberius is a master of demolitions and heavy ordnance. His expertise is crucial for navigating hazardous environments and exploiting enemy weaknesses, though his past hints at a more ruthless pragmatism.",
        "locations": [
          "scene_001_insertion",
          "scene_002_corridor_alpha",
          "scene_003_first_squad_fate",
          "scene_004_restricted_sector",
          "scene_004_1_rescue_attempt",
          "scene_005_hive_mind_presence",
          "scene_006_confrontation",
          "scene_007_final_choice",
          "scene_008_extraction_destroy",
          "scene_008_extraction_retrieve",
          "scene_009_escape_or_doom"
        ],
        "dialogue_themes": [
          "Structural Analysis",
          "Weapon Effectiveness",
          "Environmental Hazards",
          "Implicit Warnings",
          "Cold Pragmatism"
        ]
      },
      {
        "id": "npc_004_trapped_personnel",
        "name": "Trapped Imperial Personnel / Servitors",
        "role": "Conditional Rescuees / Moral Dilemma Element",
        "description": "A small group of desperate Imperial crewmen or servitors, survivors from the original vessels fused into the Hulk. They are terrified and under attack from minor Tyranid organisms, representing the innocent lives caught in the conflict.",
        "locations": [
          "scene_004_restricted_sector",
          "scene_004_1_rescue_attempt"
        ],
        "narrative_significance": "These NPCs serve as the core of the 'dp_trapped_personnel' decision point and 'plot4_moral_dilemma'. Their presence forces Raphael to weigh his primary mission against the value of Imperial lives, directly influencing squad morale and resource expenditure. Successfully rescuing them can provide a temporary morale boost, while abandoning them can cause a dip and internal conflict for Raphael.",
        "dialogue_themes": [
          "Pleading for Rescue",
          "Fear and Desperation",
          "Gratitude (if rescued)",
          "Minor Information (about local area or Hulk conditions)"
        ]
      }
    ]
  }
}
