{
  "puzzle_design": {
    "puzzles": [
      {
        "id": "puzzle_s02_collapsed_passage",
        "name": "Collapsed Passage Re-route",
        "description": "Valerius encounters a heavily collapsed section of the main corridor, blocking direct progress. A defunct servo-skull drone, partially buried, hints at an alternative maintenance shaft, but gaining access requires bypassing a rusted control panel.",
        "location": "scene_02_isolated_survival",
        "narrative_purpose": "Forces the player to choose between a direct, but risky, path or a technical bypass, reinforcing the 'isolated survival' theme and demonstrating Valerius's adaptability under pressure. Leads directly into Character Moment for Valerius to fight growing Black Rage or manage a direct, tactical choice.",
        "solution": {
          "type": "environmental_interaction_and_choice",
          "steps": [
            "Inspect collapsed corridor: reveals no immediate way through.",
            "Locate defunct servo-skull: reveals a schematic for the alternate maintenance shaft entrance and a cryptic access code fragment.",
            "Interact with rusted control panel: requires a minor logic-puzzle or quick-time event to re-route power, then inputting the fractured code. Success opens the shaft. Failure could trigger a minor Genestealer ambush.",
            "Alternatively: Attempt to 'clear rubble' directly (s02_d1_path_choice), triggering a combat encounter and consuming more time/resources."
          ]
        },
        "difficulty": "medium"
      },
      {
        "id": "puzzle_s04_data_fragment_reconstruction",
        "name": "Ancient Data-Slate Reconstruction",
        "description": "In a forgotten utility station, Brother Arion discovers several heavily damaged and encrypted Imperial data-slates. Piecing together the fragments and decrypting the corrupted files could reveal crucial information about the Hulk's past and the C'tan Shard.",
        "location": "scene_04_deeper_hulk_investigation",
        "narrative_purpose": "Allows Brother Arion to showcase his intellectual curiosity and analytical skills while driving forward 'Unveiling the Hulk's Secrets'. It provides direct lore delivery, tying into plot point pp_04, and deepens the player's understanding of the context. This puzzle directly precedes and sets up 'Unveiling the Hulk's Secrets' (scene_05_hulk_secrets_revealed).",
        "solution": {
          "type": "logic_and_decryption",
          "steps": [
            "Collect 3-5 data-slate fragments scattered in the station (minor exploration).",
            "Bring fragments to Arion, who then initiates the reconstruction.",
            "Player assists Arion in a mini-game: connecting corrupted data nodes (logic puzzle) and entering a series of keyword sequences (lore-based guesses/hints from environmental clues) to decrypt the files.",
            "Successful decryption reveals logs detailing the Hulk's experimental warship origin, the captured C'tan Shard, and its subsequent influence."
          ]
        },
        "difficulty": "medium"
      },
      {
        "id": "puzzle_s07_lockdown_override",
        "name": "Core Chamber Lockdown Override",
        "description": "The final approach to the C'tan Shard chamber is protected by a multi-layered security lockdown, remnants of the original crew's attempt to contain the growing threat. The controls are ancient and require precise, coordinated input to bypass.",
        "location": "scene_07_approaching_the_core",
        "narrative_purpose": "Provides a significant challenge before the final confrontation, increasing tension. It requires Valerius to utilize his tactical leadership (possibly by directing Arion or Tiberius's actions) and illustrates the desperation of the original Imperial crew. Success allows access to pp_06 and scene_08.",
        "solution": {
          "type": "timed_coordination_puzzle",
          "steps": [
            "Player (Valerius) must activate a primary console to initiate the override sequence.",
            "Another character (e.g., Arion or Tiberius depending on proximity/player choice) must activate secondary power conduits in sequence within a strict time limit.",
            "Periodically during the override, Genestealer patrols are drawn to the activity, forcing a brief combat interruption.",
            "Failure to complete a sequence on time triggers backup security (e.g., automated turrets or flood of lesser Genestealers) that must be incapacitated before retrying."
          ]
        },
        "difficulty": "hard"
      }
    ],
    "artifacts": [
      {
        "id": "artifact_ceremonial_dag",
        "name": "Ceremonial Death Mask (Fragment)",
        "description": "A shattered fragment of a Blood Angels Death Mask, bearing the stylized tear and winged skull. It radiates a faint psychic echo of despair and duty.",
        "location": "scene_02_isolated_survival",
        "narrative_significance": "Found on a fallen brother, this artifact deeply connects to Valerius's internal conflict. Collecting these fragments (additional fragments could be found in s04) could unlock lore entries about the Death Company or trigger Valerius's 'Black Rage' internal monologue moments, reinforcing his struggle with his inherited curse and the sacrifice of his brethren. It directly supports Valerius's character arc.",
        "properties": [
          {
            "property": "triggers_dialogue",
            "value": "Valerius reflection on the Death Company and Black Rage"
          },
          {
            "property": "minor_sanity_drain_or_buff",
            "value": "depending on player's current Black Rage level"
          }
        ]
      },
      {
        "id": "artifact_ctan_shard_data",
        "name": "Corrupted Data-Slate (from C'tan Shard)",
        "description": "A partially melted and heavily corrupted data-slate, emanating faint, unsettling energy. It seems to react to Brother Arion's presence.",
        "location": "scene_04_deeper_hulk_investigation",
        "narrative_significance": "This is a key artifact directly related to the C'tan Shard and Arion's growing obsession. When discovered, it triggers Arion's interest in 'purifying' and weaponizing the shard (pp_05). It acts as a physical manifestation of the Shard's influence and Arion's character arc development. Successfully deciphering it via the puzzle 'Ancient Data-Slate Reconstruction' reveals critical lore about the Shard's origins and capabilities, fueling Arion's arguments.",
        "properties": [
          {
            "property": "emits_psychic_resonance",
            "value": "high"
          },
          {
            "property": "unlocks_arion_dialogue_tree",
            "value": "regarding purification/weaponization"
          },
          {
            "property": "lore_source",
            "value": "C'tan Shard history"
          }
        ]
      },
      {
        "id": "artifact_hulk_doomsday_key",
        "name": "Doomsday Protocol Activation Key",
        "description": "A heavy, archaic cogitator key shaped like an Aquila, designed for a singular, catastrophic purpose: the annihilation of the 'Goliath's Maw'. It is protected by hardened adamantium casing.",
        "location": "scene_08_final_confrontation",
        "narrative_significance": "The ultimate instrument of 'Survival vs. Sacrifice'. Finding this key presents Valerius with the 'Martyrdom Ending' option (s08_d1_ending_choice). Its presence raises the stakes of the final confrontation and forces the player to consider the ultimate cost of eliminating the C'tan Shard. It is the physical linchpin for one of the primary narrative resolutions.",
        "properties": [
          {
            "property": "activates_doomsday_protocol",
            "value": "confirm_destruction_sequence"
          },
          {
            "property": "plot_critical",
            "value": "ending_trigger"
          }
        ]
      }
    ],
    "monsters": [
      {
        "id": "monster_genestealer_patrol",
        "name": "Genestealer Patrol",
        "description": "Standard Genestealer brood, fast, chitin-armored, and equipped with razor-sharp claws. They hunt in small packs and are adept at ambushes.",
        "locations": [
          "scene_01_insertion",
          "scene_02_isolated_survival",
          "scene_04_deeper_hulk_investigation",
          "scene_07_approaching_the_core"
        ],
        "narrative_role": "The primary physical threat throughout the game. Their increasing numbers and tactical sophistication (from simple ambushes to coordinated attacks) reflect the growing influence of the Patriarch and C'tan Shard, serving the 'Man vs. Alien' theme. They provide continuous challenge and reinforce the grim reality of the Space Hulk.",
        "abilities": [
          "Claw attack",
          "Ambush",
          "Swarm tactics"
        ]
      },
      {
        "id": "monster_broodlord",
        "name": "Broodlord (Enhanced)",
        "description": "A larger, more aggressive Genestealer alpha, exhibiting rudimentary psychic abilities and enhanced resilience due to the C'tan Shard's influence. It leads larger broods.",
        "locations": [
          "scene_04_deeper_hulk_investigation",
          "scene_07_approaching_the_core"
        ],
        "narrative_role": "Serves as a mini-boss or significant encounter that showcases the increasing threat of the Genestealer infestation (pp_03). Its psychic enhancement directly links to the C'tan Shard's corrupting influence, demonstrating the power that Arion seeks to control and the intensity of the Patriarch's domain. It highlights the growing pressure on Valerius and the squad.",
        "abilities": [
          "Psychic Scream (disorient)",
          "Coordinated Charge",
          "Rending Claws",
          "Area-of-effect aura (fear/slow)"
        ]
      },
      {
        "id": "monster_patriarch_ascendant",
        "name": "Genestealer Patriarch (Ascendant)",
        "description": "The ancient and most formidable leader of the Hulk's Genestealer brood, significantly empowered by the C'tan Shard. It radiates a potent psychic presence, controls the entire infestation, and is a master tactician in battle.",
        "locations": [
          "scene_08_final_confrontation"
        ],
        "narrative_role": "The ultimate physical antagonist, representing the peak of the 'Man vs. Alien' conflict and the corrupting power of the C'tan Shard. Its heightened intelligence and psychic abilities are a direct consequence of the Shard (pp_03, pp_06). Defeating the Patriarch is a monumental task that tests all of Valerius's skills and the squad's cohesion, directly preceding the final choice regarding the Shard. Its death or survival is tied to the game's ending.",
        "abilities": [
          "Massive Psychic Blasts",
          "Mind Control (on lesser Genestealers)",
          "Devastating Melee",
          "Hive Mind Command (spawns reinforcements)",
          "Telekinetic Shield (briefly invulnerable)"
        ]
      }
    ],
    "npcs": [
      {
        "id": "npc_sergeant_valerius",
        "name": "Brother-Sergeant Valerius",
        "role": "Player Character, Squad Leader",
        "description": "A veteran Death Company Terminator, struggling against the Black Rage. His duty and faith are constantly tested by the grim reality of the Hulk and his internal demons. He is the player's avatar and moral compass.",
        "locations": [
          "scene_01_insertion",
          "scene_02_isolated_survival",
          "scene_03_reunion_arion",
          "scene_04_deeper_hulk_investigation",
          "scene_05_hulk_secrets_revealed",
          "scene_06_moral_dilemma",
          "scene_07_approaching_the_core",
          "scene_08_final_confrontation"
        ],
        "dialogue_themes": [
          "Duty and Sacrifice",
          "Black Rage (internal struggle)",
          "Faith vs. Heresy",
          "Leadership",
          "Redemption"
        ]
      },
      {
        "id": "npc_arion",
        "name": "Brother Arion",
        "role": "Librarian, Moral Catalyst",
        "description": "A highly intelligent Blood Angels Librarian, whose intellectual curiosity and thirst for forbidden knowledge lead him down a dangerous path of subtle corruption by the C'tan Shard. He challenges Valerius's Imperial orthodoxy.",
        "locations": [
          "scene_03_reunion_arion",
          "scene_04_deeper_hulk_investigation",
          "scene_05_hulk_secrets_revealed",
          "scene_06_moral_dilemma",
          "scene_07_approaching_the_core",
          "scene_08_final_confrontation"
        ],
        "dialogue_themes": [
          "Knowledge and Power",
          "Xenos Lore",
          "Warp Influence",
          "Purification vs. Destruction",
          "Pragmatism vs. Ideology"
        ]
      },
      {
        "id": "npc_tiberius",
        "name": "Brother Tiberius",
        "role": "Death Company Exemplar, Combat Support",
        "description": "A stoic Death Company Marine, fully consumed by the Black Rage but channeling it into disciplined ferocity against xenos. He serves as a mirror to Valerius's potential fate and a staunch, albeit often unthinking, adherent to Imperial holy wrath.",
        "locations": [
          "scene_03_reunion_arion",
          "scene_04_deeper_hulk_investigation",
          "scene_06_moral_dilemma",
          "scene_07_approaching_the_core",
          "scene_08_final_confrontation"
        ],
        "dialogue_themes": [
          "Vengeance",
          "Hatred of Xenos",
          "Sanguinius's Sacrifice",
          "Unyielding Faith",
          "Brutal Efficiency"
        ]
      },
      {
        "id": "npc_ancient_comms_log",
        "name": "Ancient (Automated) Comms Log",
        "role": "Lore Provider, Atmospheric Element",
        "description": "Fragmented, automated audio logs or visual recordings from the original Imperial crew of the 'Goliath's Maw' before its fall. The voices are often panicked, desperate, or filled with grim determination.",
        "locations": [
          "scene_04_deeper_hulk_investigation",
          "scene_05_hulk_secrets_revealed"
        ],
        "narrative_role": "Provides critical backstory (pp_04) about the Hulk's origins, the C'tan Shard's capture, and the events leading to the ship's perdition. These logs reinforce the 'Cosmic Horror' theme and show the desperate struggle of previous Imperial forces against an unknowable threat, foreshadowing the gravity of Valerius's mission. Their fragmented nature adds to the mystery and allows for the 'Ancient Data-Slate Reconstruction' puzzle.",
        "dialogue_themes": [
          "Desperation",
          "Discovery of the Shard",
          "The Horus Heresy (references)",
          "Failure of Containment",
          "Doomsday Prep"
        ]
      }
    ]
  }
}
